[

  {
    "title": "Welcome to Netdrop",
    "text": [
      "It looks like this might be your first time using Netdrop. Here is a quick guide to help you get started. Navigate with \"next\" and \"back\" buttons or press \"skip\" to skip the guide. You can always review this guide later by pressing the info icon on the right.",
      "Netdrop is a lightweight web-based FTP client. Since the webserver needs to act as a middle man, it is not meant to be used for large file transfers.  Instead, it is meant to be a convenient tool for web developers by allowing saving FTP credentials, having code highlighting, and in-browser text editor."
    ],
    "highlight": "#guide-button",
    "image": null
  },

  {
    "title": "New Connection",
    "text": [
      "To start actually using the app, you need to press the \"new connection\" button.",
      "After pressing it, a form will open up, allowing you to enter your FTP credentials. If the connection succeeds, you will get a directory listing of the main folder."
    ],
    "highlight": "#nav-login",
    "image": null
  },

  {
    "title": "Directory Listing",
    "text": [
      "After establishing a connection, you will get an output similar to the one below. It's a list of files and folders in your root directory with some basic info.",
      "You can easily differentiate files and folders because folders don't have size. Clicking on a folder will enter it while clicking on a file will download it.",
      "The slash you see on the bottom displays the path of your current directory."
    ],
    "highlight": null,
    "image": "1.png"
  },

  {
    "title": "Adding Files",
    "text": [
      "When you want to upload a file or create a directory, your best friend is the add button you could see on the previous tab.",
      "You can also drag and drop your items to the directory table to upload them; note, however, that this feature may not be well supported on all browsers and could lead to some chaotic behavior.",
      "Side note: files will be overwritten without warning. The same goes for deleting; I am not responsible for any damage caused by this."
    ],
    "highlight": null,
    "image": null
  },

  {
    "title": "Option Menu",
    "text": [
      "Right-clicking an item or pressing the three bars icon on the right will open a menu similar to the one below.",
      "All of those options should be self-explanatory, but I will quickly describe the \"view\" one. So, you can view image files smaller than 4MB; and text files smaller than 0.5MB. The textual files will have code highlighting; and the option to edit and save them in-browser. Beware that determining what file is textual can be a little problematic, so you might be able to view some smaller binary files."
    ],
    "highligh": null,
    "image": "2.png"
  },

  {
    "title": "Netdrop Account",
    "text": [
      "With just a username and a password, you can create an account. Having an account enables you to securely save your FTP credentials.",
      "While logged in, after each unique successful connection, you will be prompted to save your credentials by naming them. You can later find them in a dropdown menu; on the \"new connection\" tab, as shown below. To delete them, go to your profile by clicking on your username."
    ],
    "highlight": "#nav-account",
    "image": "3.png"
  },

  {
    "title": "Theme Button",
    "text": [
      "Lastly, there is a very obvious theme button. It is simply a switch for dark and light theme.",
      "And with that, you should be all set. Hope the app servers you well."
    ],
    "highlight": "#theme-button",
    "image": null
  }

]
